import { Area } from './db/schema.js';

export const areasState: Omit<Area, 'id'>[] = [
  {
    name: 'Донецька область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Луганська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Харківська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Полтавська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Сумська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Чернігівська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Киівська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Київ',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Житомирська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Рівненська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Волинська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Львівська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Закарпатська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Івано-Франківська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Чернівецька область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Тернопільська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Хмельницька область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Вінницька область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Кіровоградська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Одеська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Миколаївська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Дніпропетровська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Запорізька область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Херсонська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  {
    name: 'Крим',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
];
