import { Area } from './db/schema.js';

export const areasState: Record<Area['id'], Omit<Area, 'id'>> = {
  '1': {
    name: 'Донецька область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '2': {
    name: 'Луганська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '3': {
    name: 'Харківська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '4': {
    name: 'Полтавська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '5': {
    name: 'Сумська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '6': {
    name: 'Чернігівська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '7': {
    name: 'Киівська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '8': {
    name: 'Київ',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '9': {
    name: 'Житомирська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '10': {
    name: 'Рівненська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '11': {
    name: 'Волинська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '12': {
    name: 'Львівська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '13': {
    name: 'Закарпатська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '14': {
    name: 'Івано-Франківська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '15': {
    name: 'Чернівецька область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '16': {
    name: 'Тернопільська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '17': {
    name: 'Хмельницька область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '18': {
    name: 'Вінницька область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '19': {
    name: 'Кіровоградська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '20': {
    name: 'Одеська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '21': {
    name: 'Миколаївська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '22': {
    name: 'Дніпропетровська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '23': {
    name: 'Запорізька область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '24': {
    name: 'Херсонська область',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
  '25': {
    name: 'Крим',
    alert: 0,
    updated: '1970-01-01T00:00:00.000Z',
  },
};
